{
  "layers": [
    {
      "class_name": "InputLayer", 
      "config": {
        "dtype": "float32", 
        "batch_input_shape": [
          null, 
          5
        ], 
        "name": "query", 
        "sparse": false
      }, 
      "inbound_nodes": [], 
      "name": "query"
    }, 
    {
      "class_name": "InputLayer", 
      "config": {
        "dtype": "float32", 
        "batch_input_shape": [
          null, 
          50
        ], 
        "name": "doc", 
        "sparse": false
      }, 
      "inbound_nodes": [], 
      "name": "doc"
    }, 
    {
      "class_name": "Embedding", 
      "config": {
        "embeddings_initializer": {
          "class_name": "RandomUniform", 
          "config": {
            "maxval": 0.05, 
            "seed": null, 
            "minval": -0.05
          }
        }, 
        "name": "embedding_1", 
        "dtype": "int32", 
        "output_dim": 50, 
        "trainable": false, 
        "embeddings_regularizer": null, 
        "input_dim": 193368, 
        "mask_zero": false, 
        "embeddings_constraint": null, 
        "batch_input_shape": [
          null, 
          null
        ], 
        "activity_regularizer": null, 
        "input_length": null
      }, 
      "inbound_nodes": [
        [
          [
            "query", 
            0, 
            0, 
            {}
          ]
        ], 
        [
          [
            "doc", 
            0, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "embedding_1"
    }, 
    {
      "class_name": "Conv1D", 
      "config": {
        "kernel_constraint": null, 
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "conv1d_1", 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "relu", 
        "trainable": true, 
        "padding": "same", 
        "strides": [
          1
        ], 
        "dilation_rate": [
          1
        ], 
        "kernel_regularizer": null, 
        "filters": 64, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "use_bias": true, 
        "activity_regularizer": null, 
        "kernel_size": [
          3
        ]
      }, 
      "inbound_nodes": [
        [
          [
            "embedding_1", 
            0, 
            0, 
            {}
          ]
        ], 
        [
          [
            "embedding_1", 
            1, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "conv1d_1"
    }, 
    {
      "class_name": "MaxPooling1D", 
      "config": {
        "padding": "same", 
        "strides": [
          2
        ], 
        "trainable": true, 
        "name": "max_pooling1d_1", 
        "pool_size": [
          2
        ]
      }, 
      "inbound_nodes": [
        [
          [
            "conv1d_1", 
            0, 
            0, 
            {}
          ]
        ], 
        [
          [
            "conv1d_1", 
            1, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "max_pooling1d_1"
    }, 
    {
      "class_name": "Flatten", 
      "config": {
        "trainable": true, 
        "name": "flatten_1"
      }, 
      "inbound_nodes": [
        [
          [
            "max_pooling1d_1", 
            0, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "flatten_1"
    }, 
    {
      "class_name": "Flatten", 
      "config": {
        "trainable": true, 
        "name": "flatten_2"
      }, 
      "inbound_nodes": [
        [
          [
            "max_pooling1d_1", 
            1, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "flatten_2"
    }, 
    {
      "class_name": "Concatenate", 
      "config": {
        "trainable": true, 
        "name": "concatenate_1", 
        "axis": -1
      }, 
      "inbound_nodes": [
        [
          [
            "flatten_1", 
            0, 
            0, 
            {}
          ], 
          [
            "flatten_2", 
            0, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "concatenate_1"
    }, 
    {
      "class_name": "Dense", 
      "config": {
        "kernel_initializer": {
          "class_name": "VarianceScaling", 
          "config": {
            "distribution": "uniform", 
            "scale": 1.0, 
            "seed": null, 
            "mode": "fan_avg"
          }
        }, 
        "name": "dense_1", 
        "kernel_constraint": null, 
        "bias_regularizer": null, 
        "bias_constraint": null, 
        "activation": "linear", 
        "trainable": true, 
        "kernel_regularizer": null, 
        "bias_initializer": {
          "class_name": "Zeros", 
          "config": {}
        }, 
        "units": 1, 
        "use_bias": true, 
        "activity_regularizer": null
      }, 
      "inbound_nodes": [
        [
          [
            "concatenate_1", 
            0, 
            0, 
            {}
          ]
        ]
      ], 
      "name": "dense_1"
    }
  ], 
  "input_layers": [
    [
      "query", 
      0, 
      0
    ], 
    [
      "doc", 
      0, 
      0
    ]
  ], 
  "output_layers": [
    [
      "dense_1", 
      0, 
      0
    ]
  ], 
  "name": "model_1"
}